#указываем самый базовый слой, базовый докер образ
FROM python:3.11

#дальше идет код, чтобы подготовить докер образ к запуску нашего приложения
#обозначаем рабочую директорию
WORKDIR /code

#копируем требования и кладем туда, где они будут лежать в докер образе
COPY requirements.txt .

#установим зависимости, не используем кэш(пип обычно кеширует). заметим, что мы не устанваливаем вирт.окр, оно не нужно
RUN pip install --no-cache-dir --upgrade -r requirements.txt

#копируем приложение, без тестов
COPY app ./app

#команда для запуска приложения(порт к-й прописали здесь он внутри контейнера, надо мапинг сделать
# --port 8082:80 (сначала порт нашего сервера, затем порт контейнера)
CMD ["fastapi", "run", "app/main.py", "--port", "80"]